AndrewJNg/ECE4191-G3/PSoC components/Colour_Sensor/TCS3200.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "PWM_Test_Signal.h"
#include "Clock_2.h"
#include "Pulse_counter.h"
#include "Clock_3.h"
#include "freq_isr.h"
#include "UART_1.h"
#include "LED_aliases.h"
#include "LED.h"
#include "LED_1_aliases.h"
#include "LED_1.h"
#include "Pin_1_aliases.h"
#include "Pin_1.h"
#include "Clock_4.h"
#include "Clock_5.h"
#include "Count7_1ms.h"
#include "ColourSensor_S0_aliases.h"
#include "ColourSensor_S0.h"
#include "ColourSensor_S1_aliases.h"
#include "ColourSensor_S1.h"
#include "ColourSensor_S2_aliases.h"
#include "ColourSensor_S2.h"
#include "ColourSensor_S3_aliases.h"
#include "ColourSensor_S3.h"
#include "ColourSensor_OUT_aliases.h"
#include "ColourSensor_OUT.h"
#include "Control_Reg_1.h"
#include "UART_1_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

